In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as mlb

In [3]:
df = pd.read_csv('C:/Users/sahil/Desktop/datasets/Social_Network_Ads.csv')
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [4]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [5]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [6]:
df.dtypes

User ID             int64
Gender             object
Age                 int64
EstimatedSalary     int64
Purchased           int64
dtype: object

In [7]:
val = pd.get_dummies(df.Gender)
val

     Female  Male
0         0     1
1         0     1
2         1     0
3         1     0
4         0     1
..      ...   ...
395       1     0
396       0     1
397       1     0
398       0     1
399       1     0

[400 rows x 2 columns]

In [8]:
df2 = df.drop('Gender', axis=1)
df2

      User ID  Age  EstimatedSalary  Purchased
0    15624510   19            19000          0
1    15810944   35            20000          0
2    15668575   26            43000          0
3    15603246   27            57000          0
4    15804002   19            76000          0
..        ...  ...              ...        ...
395  15691863   46            41000          1
396  15706071   51            23000          1
397  15654296   50            20000          1
398  15755018   36            33000          0
399  15594041   49            36000          1

[400 rows x 4 columns]

In [10]:
df2_x = pd.DataFrame(df2, columns=['Age', 'EstimatedSalary'])
df2_x

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [11]:
df2_y = pd.DataFrame(df2, columns=['Purchased'])
df2_y

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [12]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [14]:
x_train, x_test, y_train, y_test = train_test_split(df2_x, df2_y, test_size = 0.3, random_state = 42)

In [15]:
model = LogisticRegression()
model.fit(x_train, y_train)

C:\Users\sahil\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression()

In [16]:
y_pred = model.predict(x_test)

In [17]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)
cm

array([[73,  0],
       [47,  0]], dtype=int64)

In [22]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test, y_pred)*100)
from sklearn.metrics import precision_score
print(precision_score(y_test, y_pred)*100)

0.0

C:\Users\sahil\anaconda3\lib\site-packages\sklearn\metrics\_classification.py:1318: UndefinedMetricWarning: Precision is ill-defined and being set to 0.0 due to no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [63]:
tp = cm[0, 0]
fp = cm[0, 1]
fn = cm[1, 0]
tn = cm[1, 1]

0

In [58]:
accuracy = (tp+tn)/(tp+tn+fp+fn)

In [59]:
error_rate = (fp+fn)/(fp+fn+tp+tn)

In [61]:
precision = tp/(tp+fp)

In [62]:
specificity = (tn)/(tn+fp)

C:\Users\sahil\AppData\Local\Temp\ipykernel_11184\3358441823.py:1: RuntimeWarning: invalid value encountered in longlong_scalars
  specificity = (tn)/(tn+fp)

In [64]:
recall = (tp)/(tp+fn)